snlkuharlocal/src/Catalogs/Партии/Партии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партии</name>
  <attributes>
    <name>ПНК</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКороба</name>
    <type>
      <types>CatalogRef.ТипыКоробов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтейнера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PSD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарезервирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/Партии/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

Если ОбменДанными.загрузка тогда
		возврат;
	Конецесли;
	// Новый формат 	0229/12-100000
	//Катаев+ 15/09/14
	Если ПустаяСтрока(Наименование) Тогда
		Сообщить("Не заполнен ИМ7! Сохранение партии невозможно!");
		Отказ=ИСТИНА;
		возврат;
	КонецЕсли;
	//Катаев- 15/09/14
	спр=Справочники.Партии.НайтиПоНаименованию(наименование);
	если НЕ Спр.Пустая() и спр.ссылка<>ссылка тогда
		//Катаев+ 15/09/14
		//Сообщить("Уже имеется "+наименование+" используйте его!");Отказ=ИСТИНА;возврат;
		Сообщить("ИМ7 с номером "+наименование+" уже заведен в базу данных! Сохранение невозможно");
		Отказ=ИСТИНА;
		возврат;
		//Катаев- 15/09/14
	Конецесли;		
	
	поз1=Найти(Наименование,"/");
	поз2=Найти(Наименование,"-");
	Если Поз1>0 и Поз2>0 тогда
		Год=Сред(наименование,Поз1+1,поз2-поз1-1);
		Попытка 
			год=число(год);
			Номер=Сред(Наименование,Поз2+1,20);
			код1="20"+год+номер;
			код=число(код1);
		исключение
			сообщить("Неправильный формат ИМ7. (должен быть типа 0229/12-100000");  Отказ=истина;возврат;
		Конецпопытки;
		
	Конецесли;

	
	Если ТипЗнч(ПНК)<>ТИП("ДокументСсылка.Перемещение") тогда
		Если  (код=0 и СтрДлина(Сокрлп(Наименование))>0 и ВРЕГ(Лев(Наименование,3))<>"PMD") или (Лев(Код,4)="9999") тогда
			Попытка
				код=10000*Число(Лев(наименование,4))+Число(Сред(наименование,6,10));
			исключение
				Сообщить("Правильный формат ИМ7: первые 4 цифры-год\номер.Задайте правильно и пересохраните элемент.(Или задайте PMD)");
				код=0;
			Конецпопытки;
		Конецесли;
	Конецесли;
	
	//крохин начало  05.10.2015
	//ДатаПоступления, для упорядочивания при печати нарядов
	Если НЕ ЗначениеЗаполнено(ДатаПоступления) Тогда
		Если ПНК <> Неопределено Тогда
			ДатаПоступления = ПНК.Дата;
		КонецЕсли;
	КонецЕсли;
	//крохин конец 05.10.2015
	
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);

	
КонецПроцедуры
